# Вывести все элементы списка, которые меньше 5. Предоставить два решения: при помощи функции 
# filter и списочного выражения
l = list(map(lambda x: int(x), input("Введите числа через пробел: ").split()))
print(*sorted(l, key=lambda x: abs(x)))